# Missing Values in DataFrames

Missing values in pandas Dataframes are represented as `NaN` (Not a Number). 

A Dataframe may have `NaN` values in different columns, which may  create issues in data analysis. 

To address missing values, we start with a CSV file that contains some missing values.

In [27]:
import pandas as pd

# Loading the sales.csv file
url = "https://raw.githubusercontent.com/zhouy185/BUS_O712/main/Data/sales.csv"

sales=pd.read_csv(url) 

sales.head(10)

      stores  january  february    march    april
0  store_139  40824.0   40216.0      NaN  35065.0
1   store_52  38476.0   38616.0  38325.0      NaN
2   store_36  42875.0       NaN  41219.0  42279.0
3   store_71  36112.0       NaN  39021.0  41521.0
4   store_12      NaN   36198.0  42958.0  44595.0
5        NaN  39912.0   44106.0  44853.0  43256.0
6   store_14  45105.0   37296.0  42293.0  40126.0
7    store_8      NaN   43471.0  35589.0      NaN

We now use different approaches to deal with missing values

## Dropping missing values

One approach is to drop all the records (i.e., rows) with any `NaN`, by using `dropna()` function to return a DataFrame without rows that have `NaN` values.

In [28]:
sales.dropna()

     stores  january  february    march    april
6  store_14  45105.0   37296.0  42293.0  40126.0

Note that this will not affect the original `sales` DataFrame.

We can assign it to a new DataFrame.

In [29]:
# Assign the dataframe to a new DataFrame named sales_no_na
sales_no_na = sales.dropna()
sales_no_na

     stores  january  february    march    april
6  store_14  45105.0   37296.0  42293.0  40126.0

Alternatively, if we want the Dataframe to change we should add the argument `inplace` and set it to `True`:

* `df.dropna(inplace=True)`

For any particular **column**, we may filter out the **rows** that have missing values.

* First, use the `notna()` function to determine if each row of **the column** is <u>**not** a missing value</u>
* Then, use `df[condition]` to get all rows of the DataFrame that does not have a missing value in **the column**

In [31]:
# Focus on the column "stores"
sales['stores'].notna()

0     True
1     True
2     True
3     True
4     True
5    False
6     True
7     True
Name: stores, dtype: bool

In [32]:
# Filter out all rows of the DataFrame that do not have a missing "stores" values

sales[sales['stores'].notna()]

      stores  january  february    march    april
0  store_139  40824.0   40216.0      NaN  35065.0
1   store_52  38476.0   38616.0  38325.0      NaN
2   store_36  42875.0       NaN  41219.0  42279.0
3   store_71  36112.0       NaN  39021.0  41521.0
4   store_12      NaN   36198.0  42958.0  44595.0
6   store_14  45105.0   37296.0  42293.0  40126.0
7    store_8      NaN   43471.0  35589.0      NaN

**Note**: the condition `sales['stores'].notna()` has values True and False. 

The True values are returned, which are indexes 0, 1, 2, 3, 4 and 6. The above code is equivalent to `sales[[0, 1, 2, 3, 4, 6]]`

The function `isnull()` can find out which values are missing.
* This function can be applied to the entire DataFrame

In [33]:
sales.isnull()

   stores  january  february  march  april
0   False    False     False   True  False
1   False    False     False  False   True
2   False    False      True  False  False
3   False    False      True  False  False
4   False     True     False  False  False
5    True    False     False  False  False
6   False    False     False  False  False
7   False     True     False  False   True

This function is useful for counting the missing values in each column, when used with the `sum()` function

In [34]:
sales.isnull().sum()

stores      1
january     2
february    2
march       1
april       2
dtype: int64

The above indicates that the variables 'stores' and 'march' had each 1 missing value, variables 'january', 'february' and 'april' had each 2 missing values.

**Question**: What are some disadvantages of dropping missing values?

## Imputing missing values

Instead of filtering out records with NaN, one approach is to fill them in with another value.

Different values could be used. Focusing on a particular column, we can use:

* the average
* the median
* the mode

of all non-`NaN` values in the column.

To do that, we can use the `fillna()` function. 

Inside the `()` should be the value to replace `NaN` with.

In [35]:
# In the 'stores' column, replace the NA's by 'unknown_store'
sales['stores'] = sales['stores'].fillna('unknown_store')
sales

          stores  january  february    march    april
0      store_139  40824.0   40216.0      NaN  35065.0
1       store_52  38476.0   38616.0  38325.0      NaN
2       store_36  42875.0       NaN  41219.0  42279.0
3       store_71  36112.0       NaN  39021.0  41521.0
4       store_12      NaN   36198.0  42958.0  44595.0
5  unknown_store  39912.0   44106.0  44853.0  43256.0
6       store_14  45105.0   37296.0  42293.0  40126.0
7        store_8      NaN   43471.0  35589.0      NaN

Suppose we would like to impute the missing values of all numerical variables by the **average** of their corresponding column. 

We can do:

In [36]:
# Use inplace=True to change the original DataFrame; 
# use numeric_only=True to ignore the non-numeric columns
sales_imputed = sales.fillna(sales.mean(numeric_only=True))
sales_imputed

          stores       january      february         march         april
0      store_139  40824.000000  40216.000000  40608.285714  35065.000000
1       store_52  38476.000000  38616.000000  38325.000000  41140.333333
2       store_36  42875.000000  39983.833333  41219.000000  42279.000000
3       store_71  36112.000000  39983.833333  39021.000000  41521.000000
4       store_12  40550.666667  36198.000000  42958.000000  44595.000000
5  unknown_store  39912.000000  44106.000000  44853.000000  43256.000000
6       store_14  45105.000000  37296.000000  42293.000000  40126.000000
7        store_8  40550.666667  43471.000000  35589.000000  41140.333333

**Notes**: 

1. By using the key word argument `numeric_only=True`, we make sure that the `mean()` function is only applied to the numeric columns only. If we had a missing value in the 'stores' variable, that missing value would not have been imputed by the average since its corresponding column does not have any average.

2. This operation will use the average of each column to impute the missing values of that column only.

3. This operation will change the DataFrame itself when we used the argument `inplace = True`. 

4. An alternative is to apply the `fillna()` function to each variable of the DataFrame separately, with separate values

5. We can impute all columns by the median also, in this case, we would use the `median()` function instead of the mean() function

## Using regression for imputing

The following regression-based procedure can be used to impute missing values.

1.	Identify the variable with missing values in it.

2.	Only select the rows from the dataset, where there are no missing values in this variable.

3.	Assume this variable is your dependent (target) variable and other variables are the features.

4.	Develop a linear regression model and use it to predict the missing values of the target (the variables with missing values).

This topic will be discussed visually in the lecture with more details (time permitting).

The scikit-learn library implemented several imputers, see the documentation at https://scikit-learn.org/stable/modules/impute.html

# Handling Duplicated Data

**The following content can also be found in the notebook [Data_duplication.ipynb](https://www.dropbox.com/scl/fi/iaqcvhjcp6596dlmj4slw/Data_duplication.ipynb?rlkey=w8in9f0wb8tueed0yd55ys8vw&st=kwlnexzy&dl=1) covered in week 4 (asynchronous materials)**

Data cleaning often needs to identify and remove duplicated data.

For example, in the file 'sales_duplicated.csv', there are some duplicated records. Let's first load the file.

In [2]:
import pandas as pd
sales_dup=pd.read_csv("https://raw.githubusercontent.com/zhouy185/BUS_O712/main/Data/sales_duplicated.csv")
sales_dup.head(10)

          stores       january      february         march         april
0      store_139  40824.000000  40216.000000  40608.285714  35065.000000
1       store_52  38476.000000  38616.000000  38325.000000  41140.333333
2       store_52  38476.000000  38616.000000  38325.000000  41140.333333
3       store_36  42875.000000  39983.833333  41219.000000  42279.000000
4       store_71  36112.000000  39983.833333  39021.000000  41521.000000
5       store_12  40550.666667  36198.000000  42958.000000  44595.000000
6  unknown_store  39912.000000  44106.000000  44853.000000  43256.000000
7       store_14  45105.000000  37296.000000  42293.000000  40126.000000
8       store_71  36112.000000  39983.833333  39021.000000  41521.000000
9        store_8  40550.666667  43471.000000  35589.000000  41140.333333

We can figure out if each row in the dataframe is a duplicate of another row using the `duplicated()` method of the DataFrame. 

It returns an array of True and False .
* False if the row is not a duplicate 
* True if it is.

In [3]:
sales_dup.duplicated()

0    False
1    False
2     True
3    False
4    False
5    False
6    False
7    False
8     True
9    False
dtype: bool

We can then remove any duplicates from the dataframe by using the `drop_duplicates()`
* Use `inplace=True` to modify the dataframe

In [4]:
sales_dup.drop_duplicates(inplace=True)
sales_dup.head(10)

          stores       january      february         march         april
0      store_139  40824.000000  40216.000000  40608.285714  35065.000000
1       store_52  38476.000000  38616.000000  38325.000000  41140.333333
3       store_36  42875.000000  39983.833333  41219.000000  42279.000000
4       store_71  36112.000000  39983.833333  39021.000000  41521.000000
5       store_12  40550.666667  36198.000000  42958.000000  44595.000000
6  unknown_store  39912.000000  44106.000000  44853.000000  43256.000000
7       store_14  45105.000000  37296.000000  42293.000000  40126.000000
9        store_8  40550.666667  43471.000000  35589.000000  41140.333333

We can reset the indexes after dropping the duplicated rows

In [5]:
sales_dup.reset_index(drop=True,inplace=True)

In [6]:
sales_dup.head(10)

          stores       january      february         march         april
0      store_139  40824.000000  40216.000000  40608.285714  35065.000000
1       store_52  38476.000000  38616.000000  38325.000000  41140.333333
2       store_36  42875.000000  39983.833333  41219.000000  42279.000000
3       store_71  36112.000000  39983.833333  39021.000000  41521.000000
4       store_12  40550.666667  36198.000000  42958.000000  44595.000000
5  unknown_store  39912.000000  44106.000000  44853.000000  43256.000000
6       store_14  45105.000000  37296.000000  42293.000000  40126.000000
7        store_8  40550.666667  43471.000000  35589.000000  41140.333333